БИТУправление_медицинским_центром_демо/src/Catalogs/ИнструментальныеИсследования/ИнструментальныеИсследования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИнструментальныеИсследования</name>
  <comment>1.2.643.5.1.13.13.11.1471</comment>
  <attributes>
    <name>Синоним</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Метод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Область</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НМУ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Локализация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Атрибуты</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/Catalogs/ИнструментальныеИсследования/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

#Область ЗагрузкаИзЕГИСЗ

// Возвращает идентификатор основного классификатора источника на сайте росминздрава.
// 
// Возвращаемое значение:
//   - Строка.
//
Функция ПолучитьOIDСправочника() Экспорт
	Возврат "1.2.643.5.1.13.13.11.1471";
КонецФункции

// Описывает соответствие между именем реквизита в классификаторе и его именем в базе 1С.
// 
// Возвращаемое значение:
//   - Соответствие.
//
Функция ПолучитьСопоставленийРеквизитовИXMLСправочникаЕГИСЗ() Экспорт
	
	Сопоставление = Новый Соответствие;
	
	//1) ID, Уникальный идентификатор, Строковое, Обязательное;
	Сопоставление.Вставить("ID", "УИДЕГИСЗ");
	//2) FULLNAME, Полное наименование, Строковое;
	Сопоставление.Вставить("FULLNAME", "Наименование");
	//3) ANATOMIC_FIELD, Область, Строковое;
	Сопоставление.Вставить("ANATOMIC_FIELD", "Область");
	//5) SYNONYMS, Синонимы, Строковое;
	Сопоставление.Вставить("SYNONYMS", "Синоним");
	//6) METHOD, Метод, Строковое;
	Сопоставление.Вставить("METHOD", "Метод");
	//7) ANATOMIC_LOCAL, Локализация, Строковое;
	Сопоставление.Вставить("ANATOMIC_LOCAL", "Локализация");
	//14) TESTSTATUS, Статус, Строковое, Все исследования являются актуальными, поле "Статус" отражает рутинность исследования. Значение "Актуальный" означает, что исследование рекомендовано для рутинной практики, "Устаревший" - не рекомендовано для рутинной практики или морально устаревшее исследование (разрешено для использования), "Новый" - исследование проходит клиническую апробацию;
	Сопоставление.Вставить("TESTSTATUS", "Статус");
	//15) NMU, НМУ, Строковое;
	Сопоставление.Вставить("NMU", "НМУ");
	
	Возврат Сопоставление;
	
КонецФункции

// Возвращает массив структур, ключ которой - имя реквизита справочника, а значение - имя поля таблицы актуальных в общей форме загрузки.
// 
// Возвращаемое значение:
//   - Массив
//
Функция ПолучитьЗагружаемыеПоляЕГИСЗ() Экспорт
	
	Поля = Новый Структура;
	Поля.Вставить("Наименование","Наименование");
	Поля.Вставить("УИДЕГИСЗ", "УИДЕГИСЗ");
	Поля.Вставить("Архив", "Архив");
	Поля.Вставить("Статус", "Статус");
	Поля.Вставить("Синоним", "Синоним");
	Поля.Вставить("Метод", "Метод");
	Поля.Вставить("Область", "Область");
	Поля.Вставить("НМУ", "НМУ");
	Поля.Вставить("Локализация", "Локализация");
	
	Возврат Поля;
	
КонецФункции

// Дополнительные атрибуты классификатора для загрузки.
// 
// Возвращаемое значение:
//  Соответствие - дополнительные атрибуты.
//
Функция ПолучитьДополнительныеАтрибуты() Экспорт
	
	Поля = Новый Соответствие;
	
	//4) FORM_30, Код Форма 30, Строковое, Формат кода ТТТТ_ГГ_ССС (ТТТТ – номер таблицы, ГГ – номер графы, ССС – номер строки из Приказа Росстата от 27.12.2022 №985 «Об утверждении форм федерального статистического наблюдения с указаниями по их заполнению для организации Министерством здравоохранения Российской Федерации федерального статистического наблюдения в сфере охраны здоровья»), в случае соответствия нескольким кодам, они указываются через точку с запятой;
	Поля.Вставить("FORM_30", "FORM_30");
	//8) COMPONENTS, Компоненты, Строковое;
	Поля.Вставить("COMPONENTS", "COMPONENTS");
	//9) PARAMETERS, Важные данные, Строковое;
	Поля.Вставить("PARAMETERS", "PARAMETERS");
	//10) ACTION, Действие, Строковое;
	Поля.Вставить("ACTION", "ACTION");
	//11) SIDE, Сторона, Строковое;
	Поля.Вставить("SIDE", "SIDE");
	//12) PREPARATION, Подготовка, Строковое;
	Поля.Вставить("PREPARATION", "PREPARATION");
	//13) CONTRADICTION, Противопоказания, Целочисленное;
	Поля.Вставить("CONTRADICTION", "CONTRADICTION");
	//16) RadLex, RadLex, Строковое;
	Поля.Вставить("RadLex", "RadLex");
	//17) LOINC, LOINC, Строковое;
	Поля.Вставить("LOINC", "LOINC");
	//18) SNOMED_CT, SNOMED CT, Строковое;
	Поля.Вставить("SNOMED_CT", "SNOMED_CT");
	//19) SORT, Сорт, Целочисленное;
	Поля.Вставить("SORT", "SORT");
	
	Возврат Поля;
	
КонецФункции

// Формирует массив структур, ключи которых - поля для поиска существующих элементов при загрузки из ФР НСИ ЕГИСЗ,
//  а порядок в массиве - приоритет использования способов поиска.
// 
// Возвращаемое значение:
//  Массив - наборы ключей поиска.
//
Функция ПолучитьПорядокПоискаСуществующихОбъектов() Экспорт
	
	ПорядокПоиска = Новый Массив;
	
	ПоляПоиска = Новый Структура;
	ПоляПоиска.Вставить("УИДЕГИСЗ", "УИДЕГИСЗ");
	
	ПорядокПоиска.Добавить(ПоляПоиска);
	
	Возврат ПорядокПоиска;
	
КонецФункции

// Возвращает массив локализаций исследования
//
// Параметры:
//  Исследование - СправочникСсылка.ИнструментальныеИсследования
// 
// Возвращаемое значение:
//  Массив - Массив строк локализаций
//
Функция ПолучитьЛокализацииИсследования(Исследование) Экспорт
	
	Возврат СтрРазделить(Исследование.Локализация,";", Ложь); 
	
КонецФункции

#КонецОбласти

#КонецОбласти
